channel-transport/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh;
    patches           (obstacle);
    locations         volume;
    
    readData
    (
    );

    writeData
    (
        Velocity
    );
  };
};